<template>
  <main class="mb-24 p-2">
    <div class="headline my-8">Спасибо за интерес к проекту!</div>
    <div class="mt-2">
      На самом деле, это один из полигонов для моих экспериментов в области
      фронтенда. Отсюда и возможные проблемы с работой каких-то функций :С
      <br />
      Сайт написан на <span class="text-silver">Vue 3</span> и css-фреймворке
      <span class="text-silver">Tailwind</span>. В процессе работы сайт прошёл
      ряд метаморфоз:
      <br />
      <ul class="list-inside list-disc">
        <li>добавлен typescript -> выпилен typescript;</li>
        <li>
          подключен scss и использован БЭМ -> удаление их в пользу tailwind;
        </li>
        <li>отказ от двух вариантов цветовых схем;</li>
        <li>ну и конечно многократное изменение элементов дизайна;</li>
      </ul>
      <br />В настоящее время работа над проектом ведётся довольно редко, и
      заключается в основном в правке багов. <br />
      Тем не менее, если у вас есть интересные идеи или замечена ошибка (а они
      есть) вы всегда можете написать мне в
      <a
        href="https://discord.gg/eyTGuM3CUg"
        target="_blank"
        class="text-lg text-red"
      >
        Discord
      </a>
      <div class="mt-2 indent-2">
        1. Например у меня в планах есть добавление процентов дропа шмоток с
        боссов. Для этого нужно либо хорошенько потрясти авторов карты, либо
        порыться в исходниках. Плюс есть различия в цифрах для разных версий,
        влияние удачи и т.д.
        <br />
        Если у вас есть точная таблица с процентами - поделитесь, я добавлю на
        сайт.
      </div>

      <div class="indent-2">
        2. Или, как вариант, вам не нравится дизайн сайта - текущий и правда
        создан на коленке. Можете нарисовать свой, жду ссылку на фигму xD
      </div>

      <div class="indent-2">
        3. Множество предметов пока не имеют своей картинки, или возможно
        содержат ошибку в описании. Тут всё просто - скидываете мне верную
        иконку либо корректное описание. Постараюсь добавить изменение в
        кратчайшие сроки.
      </div>
    </div>
    <img
      class="m-auto"
      alt="image"
      src="/images/goblin_survival_realistic_banner.webp"
    />
  </main>
</template>
